/*
4.Да се състави програма, която извежда всички естествени трицифрени числа,
които са кратни на произведението от цифрите си.
Програмата да изведе техния общ брой.
Пример: 128, има произведение от цифри 16, а 128 се дели без остатък на 16.
Изход: 20
*/

#include<iostream>
using namespace std;
int main()
{
    int product, counter = 0;
    for(int i = 100; i <= 999; i++)
    {
        product = ((i/100 * i/10%10) * i%10);
        if(product != 0 && i % product == 0)
        {
            counter++;
        }
        product = 1;
    }
    cout<<counter;

    return 0;
}
