#include<iostream>
using namespace std;
/*
Напишете програма, която приема цели числа в интервала [1, 100]. Нека в системния вход се
въвеждат числа ДОКАТО не се въведе числото 0. Тогава програмата трябва да ни изведе всички
числа въведени четен брой пъти.
Пример:
Вход:
1
1
2
3
4
3
2
2
0
Изход: 1, 3
ЗАБЕЛЕЖКА! Число, което е въведено 0 пъти НЕ СЕ БРОИ за въведено четен брой пъти.
*/
int main()
{
    
    int arr[100], num;
    cin>>num;
    for(int i = 0; i < 100; i++)
        arr[i] = 0; /// всички клетки = 0

    while(num!=0)
    {
        arr[num-1]++; 
        cin>>num;
    }

    for(int i = 0 ; i < 100;i++)
    {
        if(arr[i] % 2 == 0 && arr[i] != 0) cout<<i+1<<" ";
    }

    return 0;
}