#include<iostream>
using namespace std;
int main()
{
    /// Преговор едномерни масиви

	/// Какво наричахме едномерен масив?
	/// Редица от клетки, които са от един и същи тип

    /// Как достъпваме елементите на едномерния масив?
    /// <име на масива>[<индекс на клетката>]

	/// Как създаваме един едномерен масив в С++?
    ///  1. Въвеждаме размера на масива в една променлива от тип int
    ///  2. Декларираме масива, като пишем <типа на клетките на масива> <името на масива>[<размера на масива>]
    ///  3. For цикъл, с който въвеждаме всеки един елемент

    /// Как да намерим сума/произведение на елементите на четните/нечетните елементи на масив?
    /// 1. Създаваме си променлива, в която ще пази сумата или произведението.
    ///
        int sz = 6;
        int arr[sz] = {4, 5, 7 , 2 , 4, 3};
        int sum = 0, prod = 1;
        for(int i = 0; i < sz; i++)
        {
            if(arr[i] % 2 == 0)
            {
                sum = sum + arr[i];
            }
            else
            {
                prod = prod * arr[i];
            }
        }

    /// Как можем да намерим минимален/максимален елемент в масив?
    /// 1. Декларираме две променливи:
    /// - минимум = първия елемент на масива или голямо число примерно 999;
    /// - максимум = първия елемент на масива или малко число примерно -1
    /// 2.
        for(int i = 0; i < sz; i++)
        {
            /// minimum
            if(arr[i] < minimum)
            {
                minimum = arr[i];
            }
            /// maximum
            if(arr[i] > maximum)
            {
                maximum = arr[i];
            }
        }
	/// Как да сортираме по големина елементите на масива?
    /// 1. Bubble sort
    /// 2. Метод на пряката селекция

	/// Как да изтрием елементи от масива?
    /// 1. Обхождаме целия масив
    /// 2. Намираме елемент, който искаме да изтрием
    /// 3. Трием елемента, като местим всички елементи с една позиция назад
    /// 4. Намаляваме размера на масива с 1.


    return 0;
}
